app/Controllers/adminuser.php

    public function hapus($id_user){
        $this->adminuserModel->delete($id_user);
---
DELETE FROM `data_user`
WHERE `id_user` IN ('2')