app/Controllers/bansos.php

SELECT *
FROM `data_user`
---
    public function admin()
    {
        $data['users'] = $this->data->findAll();